dotfiles/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dotfiles Configuration</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<h1 class="title">Dotfiles Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1380e1d">1. Configuration Files</a></li>
<li><a href="#orgf7d7c07">2. About</a></li>
</ul>
</div>
</div>
<p>
This section contains configuration files for various tools and applications.
</p>

<div id="outline-container-org1380e1d" class="outline-2">
<h2 id="org1380e1d"><span class="section-number-2">1.</span> Configuration Files</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="ideavim.html">IdeaVim</a> - Vim emulation configuration for JetBrains IDEs</li>
<li><a href="alacritty.html">Alacritty</a> - Cross-platform terminal emulator configuration</li>
<li><a href="zellij.html">Zellij</a> - Terminal workspace multiplexer configuration</li>
<li><a href="powershell.html">PowerShell</a> - PowerShell profile and aliases configuration</li>
<li><a href="emacs-j.html">Emacs J</a> - EmacsJ keymap for IntelliJ on macOS</li>
</ul>
</div>
</div>

<div id="outline-container-orgf7d7c07" class="outline-2">
<h2 id="orgf7d7c07"><span class="section-number-2">2.</span> About</h2>
<div class="outline-text-2" id="text-2">
<p>
These configuration files are designed to be tangled using Org-mode's babel functionality. Each file contains code blocks that can be extracted to their appropriate locations in your home directory or configuration folders.
</p>

<p>
To tangle a file in Emacs:
</p>
<ol class="org-ol">
<li>Open the org file</li>
<li>Run <code>C-c C-v t</code> (or <code>M-x org-babel-tangle</code>)</li>
</ol>

<p>
This will extract the code blocks to the paths specified in the <code>:tangle</code> headers.</p>
</div>
</div>
</main>
</body>
</html>
